[
  {
    "path": "posts/2022-08-01-cropmosaiks/",
    "title": "2022 MEDS Capstone Public Presentation",
    "description": "An Open Source Pipeline for Remote Sensing of Crop Yields: A Zambia Case Study.",
    "author": [
      {
        "name": "Steven Cognac, Juliet Cohen, Grace Lewin, Cullen Molitor",
        "url": {}
      }
    ],
    "date": "2022-05-28",
    "categories": [
      "Python",
      "Remote Sensing",
      "Spatial Analysis",
      "Agriculture"
    ],
    "contents": "\nThe MEDS Capstone Public Presentation is the cornerstone and culmination of the Master of Environmental Data Science program at the Bren School of Environmental Science & Management at UCSB. The capstone process pairs students in teams 2 to 4 to tackle environmental problems using open-data science practices and principles. These projects enable us to showcase our data science chops while managing all stages of a data science driven project. As if your are you own consultant offering your services, students manage client communication, expectations, timelines, deliverables, product & project updates, and communicating that science to a technical and non-technical audience.\nCheck out all of the awesome capstone projects of the MEDS 2022 cohort by clicking here.\nCropMOSAIKS\nMy capstone group created an open-source pipeline that combines satellite imagery, machine learning, and regression to predict crop yields over time. This pipeline adapts and expands upon the MOSAIKS framework described by Rolf et al. 2020. Simplified, the pipeline is a two-step process. In step 1, satellite imagery is encoded using the random convolutional features approach. In step 2, we combine the geo-located features with geo-located crop yield data to train a model and run cross-validated ridge regression. The primary contributions of this work include the following:\ndemonstrating MOSAIKS utility in the agricultural sector,\nprocessing monthly public satellite imagery (Landsat missions and Sentinel 2), and\noptimizing the pipeline using Microsoft Planetary Computer\nFigure 1. Example of processed satellite imagery for random feature 359Our capstone group consisted of four graduate students:\nmyself, Steven Cognac,\nJuliet Cohen,\nGrace Lewin, and\nCullen Molitor.\nTitle: An open-source pipeline for remote sensing of crop yields: a Zambia case study\nLink: YouTube Public Presentation Recording\nCodebase: CropMOSAIKS GitHub\nAbstract\nHigh-quality, long-term environmental data sets are the foundation of long-range risk and climate modeling. However, producing such datasets is costly, logistically challenging, and resource-intensive. Due to limited agricultural data across sub-Saharan Africa, policy-makers, farmers, and researchers are currently unable to accurately forecast short-run food security risks posed by weather anomalies and long-run climate change projections. Recent machine learning approaches applied to high-resolution satellite imagery have successfully modeled various social and environmental variables. Here, we expand upon a recently developed machine learning approach to build a model that predicts maize yields over time using public satellite imagery. We developed a generalizable pipeline from survey data through a use case for predicting maize yields in Zambia. In 2020 and 2021, the Zambia Statistics Agency could not survey maize growers due to the COVID-19 pandemic. We use our model to fill in this data gap of maize yield predictions during these years. Through parameter optimization, we selected the model with the best ability to predict over space and time. Our model performed better overall relative to its predictive performance over time. The processed satellite imagery, predictions, and pipeline serve as a tool for the research community and users interested in analyzing Zambia’s current and future food security risks. This pipeline further enables users to explore global and region-specific questions at scale.\nAcknowledgements\nBren School: Tamma Carleton, Assistant Professor; Brad Hill, IT Director; Allison Horst, Assistant Teaching Professor; Kat Le, Technical Applications Manager\nJonathan Proctor, postdoctoral fellow at the Harvard Data Science Initiative and the Center for the Environment\nBaylis Lab, University of California, Santa Barbara\nZambia Statistics Agency\nMicrosoft Planetary Computer: Caleb Robinson, Tom Augsburger\n\n\n\n",
    "preview": "posts/2022-08-01-cropmosaiks/presentation_title_pg.png",
    "last_modified": "2022-08-02T11:08:59-07:00",
    "input_file": {},
    "preview_width": 1128,
    "preview_height": 631
  },
  {
    "path": "posts/2021-11-29-deltaturbidityanalysis/",
    "title": "Cache Slough Complex Turbidity Analysis",
    "description": "EDS 222: Time-series analysis of turbidity in the Cache Slough Complex of the Inland Delta in Solano County, California. Regression of turbidity on wind speed and tide data.",
    "author": [
      {
        "name": "Steven Cognac",
        "url": {}
      }
    ],
    "date": "2021-12-02",
    "categories": [
      "R",
      "Regression"
    ],
    "contents": "\n\nContents\nResearch Question\nIntroduction\nHypothesis\nData Sources and Cleaning\nWind Data\nData Cleaning\n\nStatistical Analysis Plan\nVisualize Relationships\nRegression Analysis & Interpretation\nTesting OLS Assumptions\nConclusions and Future Analysis\nReferences\n\nResearch Question\nIn the Cache Shag Slough Complex (CSC) in the San Francisco Estuary, does turbidity (as measured in Formazin Nephelometric Units) vary with wind speed (miles per hour) and tidal stage (using gage height as a proxy).\n\nSome turbid water in Cache Shag Slough Complex.\nIntroduction\nOverview: In the lower San Francisco Estuary there is evidence of a decadal decrease in wind speed (Bever et al, 2017) from 1995 through 2015. This decrease in wind speed has been shown to be have corresponding effects on habitat, and specifically turbidity. I’m interested in understanding to what extent turbidity varies with with speed and tidal stage in the upper San Francisco Estuary.\nBackground: Turbidity is a metric of the total suspended solids in the water column and is a measure of water clarity. In freshwater systems, low turbidity is typically good because it indicates high water clarity and a healthy ecosystem. On the reverse side, high turbidity is generally bad as it blocks sunlight from reaching aquatic plants and can smother aquatic organisms leading to plant die-offs. High turbidity can also be a vector of contamination. For example, particles, pathogens, and other contaminates (lead, mercury) can adsorb to suspended solids and increase the distribution of contaminated sediments.\nMotivation: However, not all turbid waters are equal. In estuaries, a healthy amount of turbidity is an important habitat condition. Without listing the suite of ecosystem services estuaries provide, spawning and rearing habitat for forage-fish species are major components. In the San Francisco Estuary, turbidity changes can have major management implications. For example, the SF Estuary is home to the the endangered Delta Smelt, which is a fish species that thrives in relatively high-turbidity water. Another example is the management of development and restoration projects along the SF Estuary. Understanding background conditions is important for setting water quality thresholds for work in and along the estuary. The goal of this project is to understand if the relationship between turbidity, wind, and tidal stage hold true in the CSC Complex.\n\n\n\n\n\n\nHypothesis\nMy null hypotheses \\((H_0)\\) is that, in the CSC Complex, there is no relationship between hourly or daily turbidity compared to wind speed and gage height.\nMy alternative hypothesis \\((H_a)\\) is that, in the CSC Complex, there is a relationship between hourly or daily turbidity compared to wind speed and gage height.\nHere is my regression equation: \\[Turbidity_i = B_0 + B_1WindSpeed_i + B_2GageHeight + u_i\\]\nData Sources and Cleaning\nThe CSC includes portions of the Yolo Bypass, a network of major and minor sloughs, agricultural land, and the Sacramento River/Deepwater Channel. Five water quality stations and three wind stations were used for the analysis. This analysis expands upon the Bever et al. analysis by looking at the 2015 - 2021 time period. All stations were chosen based on location and data availability.\nTurbidity & Gage Height Data\nTurbidity and gage height data downloaded from the United States Geological Survey (USGS) via the “dataRetrieval” R library. The library pulls hydrologic data from the National Water System Information System (NWIS) via the National Water Dashboard. Data was generally available in 15-minute time intervals. However, turbidity data is typically messy due to sensor fouling and hence contains lots of data gaps. A fair amount of tidying was required.\nWind Data\nUS Local Climatological Data (LCD) downloaded from NOAA NCEI online portal map tool. Data available as hourly summaries from airport and other prominent weather stations. Data follows ISO 19115-2 Metadata standards for describing geographic information.\nData Cleaning\nData for the three wind stations and six water quality stations were averaged together into hourly and daily averages, respectively. Those tables were merged together.\n\n\n\nFigure 1: Correlation plots of turbidity compared to wind speed and gage height\n\n\n\nStatistical Analysis Plan\nTo assess whether turbidity varies with wind speed or gage height, I ran two linear regressions. One with hourly data and another with daily data. Analysis was completed in RStudio.\nThe general steps of this analysis plan include the following: 1. Identify question 2. Select independent and dependent variables(based on Bever et al, 2017) 3. Data download, clean, and merge 4. Visualize relationships 5. Conduct regression 6. Test OLS assumptions 7. Interpret Results 8. Conclusions and Future Research\nVisualize Relationships\n\n\n\nFigure 2: Plot of turbidity over time\n\n\n\nRelationship plots of turbidity and the two independent variables (wind speed and gage height) are included below. From 2015 to 2021, there is a decrease, on average, in hourly and daily turbidity levels. We can see gage height has a strong positive correlation with turbidity for both hourly and daily data. We also can see clustering of gage height data, especially in the hourly data. We also observe a weak positive correlation between wind speed and turbidity.\n\n\n\nFigure 3: Correlation plots of turbidity compared to wind speed and gage height\n\n\n\n\n\n\nFigure 4: Histogram and box plots of independnet and dependent variables\n\n\n\nRegression Analysis & Interpretation\nHourly Data\n\n\nObservations\n\n\n43815\n\n\nDependent variable\n\n\nturbidity_fnu\n\n\nType\n\n\nOLS linear regression\n\n\nF(2,43812)\n\n\n2206.85292\n\n\nR²\n\n\n0.09152\n\n\nAdj. R²\n\n\n0.09148\n\n\n\n\nEst.\n\n\nS.E.\n\n\nt val.\n\n\np\n\n\n(Intercept)\n\n\n-0.20424\n\n\n0.22951\n\n\n-0.88990\n\n\n0.37352\n\n\nHourlyWindSpeed\n\n\n0.15303\n\n\n0.01790\n\n\n8.54918\n\n\n0.00000\n\n\ngage_height\n\n\n1.01404\n\n\n0.01532\n\n\n66.19358\n\n\n0.00000\n\n\n Standard errors: OLS\n\n\nDaily Data\n\n\nObservations\n\n\n1935\n\n\nDependent variable\n\n\nturbidity_fnu\n\n\nType\n\n\nOLS linear regression\n\n\nF(2,1932)\n\n\n108.70531\n\n\nR²\n\n\n0.10115\n\n\nAdj. R²\n\n\n0.10022\n\n\n\n\nEst.\n\n\nS.E.\n\n\nt val.\n\n\np\n\n\n(Intercept)\n\n\n-1.45005\n\n\n1.18921\n\n\n-1.21934\n\n\n0.22286\n\n\nDailyWindSpeed\n\n\n0.23576\n\n\n0.11070\n\n\n2.12971\n\n\n0.03332\n\n\ngage_height\n\n\n1.07881\n\n\n0.07354\n\n\n14.66993\n\n\n0.00000\n\n\n Standard errors: OLS\n\n\nIntercept \\((B_0)\\): Tells us the predicted turbidity is -1.45 FNU when wind speed and gage height is zero. Logically this does not make sense as the turbidity scale typically ranges from 0 to ~500.\nCoefficient on wind speed \\((B_1)\\): There’s a predicted increase of 0.15-0.23 turbidity units (FNU) for every mile-per-hour increase in wind speed, holding the gage height fixed.\nCoefficient on gage height \\((B_2)\\): There’s a predicted increase of 1.01-1.07 turbidity units (FNU) for every foot increase in gage height, holding the wind speed fixed.\nAdjusted \\(R^2\\): About 9-10% of the variation in turbidity can be explained by wind speed and gage height. Though turbidity data was filtered to remove values over 300 FNU, there are still many extreme turbidity events that approach this outlier threshold. Adjusted \\(R^2\\) is very sensitive to outliers so it makes sense we have a low value.\nP-Value: For both the hourly and daily regressions we reject the null hypothesis that wind speed and gage height has an effect of 0 on turbidity. With hourly data, \\(p-value < 0.000\\). For the daily data, we get \\(p-value < 0.000\\) for gage height and \\(p-value < 0.03\\) for wind speed. We can say there is a statistically significant correlation for both variables.\nTesting OLS Assumptions\nWe can assume assumption 1 (linear relationship) and 2 (\\(X\\) variables are exogenous \\(\\mathop{\\boldsymbol{E}}\\left[ u \\mid X \\right] = 0\\)) of OLS hold up. However, the linear relationship is week. Assumption 3 requires our \\(X\\) variables to have variation. Based on the relationship plots above, we can see this holds true.\nAssumption 4 of OLS is more difficult to prove. It requires population disturbances \\(u_i\\) to be independently and identically distributed as normal random variables with mean zero and variance \\(\\sigma^2\\). To test assumption 4 I will generate residuals from the daily regression model and plot them.\n\n\n\nFigure 5: Histogram and box plots of independent and dependent variables\n\n\n\nThe residuals are not normally distributed as there is a long right tail with high outliers. This indicates that the regression analysis is under-predicting average hourly turbidity levels. The Q-Q Plot indicates the distribution is generally normally distributed for values up to the positive 1 theoretical quantile. This suggests that the model is not normally distributed for extreme high values.\nConclusions and Future Analysis\nThis analysis indicates that wind speed and tidal stage (gage height) correlate with higher turbidity levels at both the hourly and daily intervals. However, based on the adjusted \\(R^2\\) value, ommited variable bias is likely an issue. Two critical omitted variables we could add to the model are upstream sediment loading, wind-wave resuspension, and an interaction between some of the variables.\nBased on the residual plot, assumption 4 of OLS may not be satisfied and OLS may not be the estimator with the lowest variance. Also, because OLS is sensitive to outliers, I removed all values over 300 FNU in the turbidity dataset. This helped with the analysis, but still limits the use of OLS with the dataset. An alternative to removing values is to winsorize the dataset such that all extreme values are capped at a specified percentile range. Another option could be to choose a different regression technique. Partial least squares (PLS) is helpful when comparing multiple continuous dependent variables or when the independent variables are highly correlated. If wind-wave resuspension was added in a future analysis, PLS may prove to be a better regression method.\nBreak time variable up into categorical years + month columns so you could compare correlation on turbidity between months of the year. Wind speed in the Delta is relatively low during the late fall and winter months and then increases during the spring and summer (Schoellhamer et al. 2016).\nReferences\nBever, Aaron J., Michael L. MacWilliams, and David K. Fullerton. 2018. “Influence of an Observed Decadal Decline in Wind Speed on Turbidity in the San Francisco Estuary.” Estuaries and Coasts 41 (7): 1943–67. https://doi.org/10.1007/s12237-018-0403-x.\nSchoellhamer, D.H., G.G. Shellenbarger, M.A. Downing-Kunz, and A.J. Manning. 2016. Review of Suspended sediment in lower south Bay relevant to light attenuation and phytoplankton blooms. In Lower South Bay Nutrient Synthesis. San Francisco Estuary Institute & Aquatic Science Center, pp. 23–56.\n\n\n\n",
    "preview": "posts/2021-11-29-deltaturbidityanalysis/lindsey_slough.png",
    "last_modified": "2021-12-02T03:13:41-08:00",
    "input_file": {},
    "preview_width": 1744,
    "preview_height": 988
  },
  {
    "path": "posts/2021-09-29-blog-practice/",
    "title": "Blog Practice",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Steven Cognac",
        "url": {}
      }
    ],
    "date": "2021-09-29",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\nhttps://samanthacsik.github.io/posts/2021-09-21-my-first-test-post/\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-29T14:08:18-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-17-kimchirecipe/",
    "title": "Kimchi Recipe",
    "description": "Overview on a quick kimchi recipe.",
    "author": [],
    "date": "2021-08-17",
    "categories": [
      "food"
    ],
    "contents": "\r\nVegetable Ingredients\r\n1 napa cabbage (approx. 1-3 inch)\r\n1 Daikon (thin slices)\r\n1 Carrot (grated or matchsticks)\r\n1 bunch green onions (chopped)\r\n1/4 cup sea or kosher salt (NO IODINE)\r\nMixture Ingredients - should be consistency of soggy oatmeal. Can also combine in food processor or immersion blender.\r\n3-6 cloves garlic (minced)\r\n1-2 tbs ginger (minced)\r\n1/2 onion (minced)\r\n2-4 tbs gojuchang- fermented chili paste\r\n2-3 tbs hot pepper flakes (not red pepper flakes)\r\n3-5 tbs fish sauce\r\n2-3 tbs dried shrimp (grinded)(optional)\r\nSteps\r\nWash and cut up cabbage. Combine with 3-4 tbs of salt in large mixing bowl. Use another large bowl (weighted) to press on top. Wait 2-3hrs. Rinse cabbage with fresh water. Keep a portion of the excess salty cabbage water.\r\nPrepare Mixture\r\nDrain cabbage liquid. Keep for later. Wash cabbage with fresh water!!\r\nCombine drained cabbage and Mixture via deep tissue massage. Make sure everything is coated.\r\nBegin canning using wide-mouth jars. Pack tightly such that no large air pockets remain. Top with excess cabbage liquid.\r\nSeal somewhat tightly and place in dark space. Contents will off-gas and liquid will likely spill out so best to keep a plate or bowl underneath just in case.\r\nFigure 1. pH of Kimchi Fermentation Over Time, Source: Rhee, Sook & Lee, Jang & Lee, Cherl-Ho. (2011). Importance of lactic acid bacteria in Asian fermented foods. Microbial cell factories. 10 Suppl 1. S5. 10.1186/1475-2859-10-S1-S5.\r\n\r\n\r\n",
    "preview": "posts/2021-08-17-kimchirecipe/kimchi_canned.jpeg",
    "last_modified": "2021-09-29T14:00:32-07:00",
    "input_file": {}
  }
]
